



NETEXT WG                                                  R. Pazhyannur
Internet-Draft                                               S. Speicher
Intended status: Standards Track                           S. Gundavelli
Expires: January 23, 2015                                          Cisco
                                                             J. Korhonen
                                                                Broadcom
                                                       J. Kaippallimalil
                                                                  Huawei
                                                           July 22, 2014


       Extensions to the PMIPv6 Access Network Identifier Option
                 draft-ietf-netext-ani-location-01.txt

Abstract

   Access Network Identifier (ANI) Mobility option was introduced in
   [RFC6757] enabling a MAG to convey identifiers like network
   identifier, Geo-location, and operator-identifier.  This
   specification extends the Access Network Identifier mobility option
   with sub-options to carry Civic Location and MAG Group Identifier.
   This specification also defines a ANI Update timer sub-option that
   determines when and how often the ANI will be updated.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on January 23, 2015.

Copyright Notice

   Copyright (c) 2014 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Pazhyannur, et al.      Expires January 23, 2015                [Page 1]

Internet-Draft              Extensions to ANI                  July 2014


   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Conventions and Terminology . . . . . . . . . . . . . . . . .   3
     2.1.  Conventions . . . . . . . . . . . . . . . . . . . . . . .   3
     2.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   4
   3.  Protocol Extension  . . . . . . . . . . . . . . . . . . . . .   4
     3.1.  Civic-Location Sub-Option . . . . . . . . . . . . . . . .   4
     3.2.  MAG Group-Identifier Sub-Option . . . . . . . . . . . . .   5
     3.3.  ANI Update-Timer Sub-Option . . . . . . . . . . . . . . .   5
   4.  Protocol Considerations . . . . . . . . . . . . . . . . . . .   6
     4.1.  MAG Considerations  . . . . . . . . . . . . . . . . . . .   6
     4.2.  LMA Considerations  . . . . . . . . . . . . . . . . . . .   7
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   8
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .   9
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  10
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  10
     8.1.  Normative References  . . . . . . . . . . . . . . . . . .  10
     8.2.  Informative References  . . . . . . . . . . . . . . . . .  10
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  10

1.  Introduction

   [RFC6757] introduced the Access Network Identifier (ANI) mobility
   Option.  This enabled a MAG to provide the Network Identifier, Geo-
   Location, and Operator-Identifier sub options.  When the access
   network is WLAN, the Network Identifier sub option may contain SSID,
   and BSSID of the Access Point (AP), the Geo-Location of the AP, and
   the Operator-Identifier may contain the realm of the operator
   managing the WLAN.  The MAG sends the above information to the LMA.
   The LMA may use this information to determine access network specific
   policies (in terms of QoS, DPI, etc).  Further, the LMA may make this
   information available to location based applications.

   While the above mentioned sub-options provide a rich set of
   information, in this document we describe the need for extending the
   ANI sub options, especially for WLAN deployments.  In WLAN
   deployments (especially indoor AP deployments), it is difficult to
   provide Geo-spatial coordinates of APs.  However, for many location
   based applications the civic location is sufficient.  This motivates



Pazhyannur, et al.      Expires January 23, 2015                [Page 2]

Internet-Draft              Extensions to ANI                  July 2014


   the need for a ANI civic-location sub-option.  In many deployments,
   operators tend to create groups of APs into "AP-Groups".  These
   groups have a group identifier.  The group-identifier is used a proxy
   for coarse location (such as floor of a building, or a small
   building).  The group identifier may also be used to provide a common
   policy (e.g., QoS, charging, DPI) for all APs in that group.  This
   specification provides a sub-option for the MAG to convey a group-
   identifier to the LMA.  The provisioning of the group-identifier is
   outside the scope of this specification and is typically done via a
   configuration mechanism such as CLI (Command line Interface), CAPWAP
   ([RFC5415], [RFC5416]), etc.  This document also provides a new sub-
   option that determines how often the MAG will update the ANI.  In
   typical deployments, it is expected that the MAG will update the ANI
   as soon as it changes.  This is certainly true when the MAG is co-
   located with the AP.  When a client roams from one AP to another AP,
   the MAG on the roamed (or sometimes referred to as the target) AP
   will provide the new ANI (for example the network identifier and Geo-
   location of the new AP).  However, if the MAG is co-located with an
   Access Controller (also known as Wireless LAN Controller), then a
   client roaming from one AP to another AP does not necessarily perform
   an ANI update.  This leads to stale ANI information at the LMA.  To
   cover the cases where ANI is always fresh, ANI may be stale, we
   introduce a new ANI Update Timer option.  This enables the MAG to
   inform the LMA when and how often the MAG will update the ANI.  The
   MAG sends an ANI update only if the ANI Update Timer has expired and
   the ANI values have changed since the last ANI update.  Consequently,
   this enables the LMA to determine whether the ANI is stale or not and
   when to expect an update.  The LMA can use ANI update Timer option to
   set the maximum frequency at which it wants to receive ANI updates.
   This may be particularly useful in environments where a MAG covers a
   large number of Wi-Fi APs and there is high client mobility between
   the APs (for example in a stadium Wi-Fi deployment).

   [RFC6757] provides ANI sub-options to carry geo-location information.
   In this document we provide additional sub-options to carry civic-
   location, and AP-Group identifier.  This document also defines an ANI
   sub-option to enable a MAG to communicate how often the MAG will
   update the ANI information.

2.  Conventions and Terminology

2.1.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].





Pazhyannur, et al.      Expires January 23, 2015                [Page 3]

Internet-Draft              Extensions to ANI                  July 2014


2.2.  Terminology

   All the mobility related terms used in this document are to be
   interpreted as defined in [RFC5213] and [RFC5844].

3.  Protocol Extension

3.1.  Civic-Location Sub-Option

   The Civic-Location is a mobility sub-option carried in the Access
   Network Identifier option defined in [RFC6757].  This sub-option
   carries the Civic Location information of the mobile node as known to
   the MAG.  The format of this option is defined below.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | ANI Type=IANA |  ANI Length   |   Format      | Reserved      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Civic-Location                                     ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



                  Figure 1: Network-Identifier Sub-option

   ANI Type:  <IANA-1>

   ANI Length:  Total length of this sub option in octets, excluding the
      ANI Type and ANI length fields.

   Format:  This specifies the encoding format of the Civic-Location.
      Two values (0, and 1) are defined in this as specification as
      described below.  The remaining values (2 through 255) are
      reserved.

         0: This value denotes Binary Encoding.  The location format is
         based on the encoding format defined in Section 3.1 of
         [RFC4776], whereby the first 3 octets are not put into the
         Civic Location field (i.e., the code for the DHCP option, the
         length of the DHCP option, and the 'what' element are not
         included).

         1: This value denotes XML Encoding.  This is specified in the
         Presence Information Data Format Location Object [RFC5139].





Pazhyannur, et al.      Expires January 23, 2015                [Page 4]

Internet-Draft              Extensions to ANI                  July 2014


   Civic-Location:  This field will contain the Civic Location.  The
      format (encoding) type is specified in the format field of this
      sub option.  Note that the length shall not exceed 253 bytes.

3.2.  MAG Group-Identifier Sub-Option

   The MAG Group Identifier is a mobility sub-option carried in the
   Access Network Identifier option defined in [RFC6757].  The MAG Group
   Identifier identifies the group affiliation of the MAG within that
   Proxy Mobile IPv6 domain.  The Group-Identifier is not assumed to be
   globally unique, across different network operators.  However, Group-
   Identifier should be unique within a network identifier as identifier
   by an operator-identifier.  In domains spanning multiple operators it
   is recommended that the operator-identifier sub-option (defined in
   [RFC6757]) be used in addition to group identifier sub-option to
   ensure uniqueness.  When the MAG is configured with a group
   identifier, the MAG should send its Group-Identifier in the PBU.
   (The configuration of this identifier is outside the scope of this
   specification.  The usage of the identifier by the LMA is left to
   implementation. ) The format of this sub-option is defined below.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | ANI Type=IANA |  ANI Length   |  Group-Identifier             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



                 Figure 2: MAG Group-Identifier Sub-option

   ANI Type:  <IANA-2>

   ANI Length:  Total length of this sub option in octets, excluding the
      ANI Type and ANI length fields.  The value is always 2.

   Group-Identifier:  This is a 2 octet integer value assigned to a
      group of MAGs.

3.3.  ANI Update-Timer Sub-Option

   The ANI Update Timer is a mobility sub-option carried in the ANI
   option defined in [RFC6757].  Section 4 describes how the MAG and LMA
   may use this sub option.






Pazhyannur, et al.      Expires January 23, 2015                [Page 5]

Internet-Draft              Extensions to ANI                  July 2014


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | ANI Type=IANA |  ANI Length   |       Update-Timer            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




                  Figure 3: Network-Identifier Sub-option

   ANI Type:  <IANA-3>

   ANI Length:  Total length of this sub option in octets, excluding the
      ANI Type and ANI length fields is always 2.

   Reserved:  MUST be set to zero when sending and ignored when
      received.

   Update-Timer:  Update-Timer is a 16 bit unsigned integer.  It
      indicates the time in seconds before the MAG sends an update value
      of ANI mobility options.  A value of 0 indicates that the MAG will
      send an updated ANI mobility option as soon as it discovers a
      change in ANI values.

4.  Protocol Considerations

   The following considerations apply to the LMA and the MAG.

4.1.  MAG Considerations

   o  The conceptual Binding Update List entry data structure maintained
      by the mobile access gateway, described in Section 6.1 of
      [RFC5213], MUST be extended to store the access-network-related
      information elements associated with the current session.
      Specifically, the following parameters MUST be defined:

      *  Civic-Location

      *  MAG Group-Identifier

      *  ANI Update-Timer

   o  If the mobile access gateway is configured to support the Access
      Network Information sub-options defined in this specification, it
      SHOULD include this option with the specific sub-options in all
      Proxy Binding Update messages (including Proxy Binding Updates for
      lifetime extension and for deregistration) that it sends to the



Pazhyannur, et al.      Expires January 23, 2015                [Page 6]

Internet-Draft              Extensions to ANI                  July 2014


      local mobility anchor.  The Access Network Information option MUST
      be constructed as specified in Section 3.  It SHOULD include the
      ANI sub-option(s) that the mobile access gateway is configured to
      carry in the Proxy Mobile IPv6 messages.

   o  ANI Update Timer Considerations: The MAG sets the Update-timer
      when it sends a PBU with the ANI Update Timer sub option.  When
      the Update-timer expires the MAG sends a PBU if and only if any of
      the ANI sub options have changed values.  That is, a PBU is not
      sent if values in the ANI sub options have remained unchanged.
      Further, the Update timer is reset only when the PBU is sent.  If
      any of the ANI sub-option values have changed and the Update-Timer
      has expired then the MAG MUST send a PBU immediately.  When the
      Update-Timer Sub option is carried in a PBU, it is considered as a
      proposed value for the Update-timer.  The LMA may change the value
      of the Update-timer in Update-Timer sub option sent in a PBA.
      When the LMA provided value for the Update-timer is different than
      what is sent by the MAG, the MAG should use the LMA provided
      value.  If the MAG does not receive a Update-timer sub option in
      PBA (in response to sending the sub-option in the PBU), then MAG
      behavior is in accordance to [RFC6757].

   o  If the mobile access gateway had any of the Access Network
      Information mobility options included the Proxy Binding Update
      sent to a local mobility anchor, then the Proxy Binding
      Acknowledgement received from the local mobility anchor SHOULD
      contain the Access Network Information mobility option with the
      specific sub-options.  If the mobile access gateway receives a
      Proxy Binding Acknowledgement with a successful Status Value but
      without an Access Network Information mobility option, then the
      mobile access gateway SHOULD log the event and, based on its local
      policy, MAY proceed to terminate the mobility session.  In this
      case, the mobile access gateway knows the local mobility anchor
      does not understand the Access Network Information mobility option
      and therefore MAY consider it as a misconfiguration of the Proxy
      Mobile IPv6 domain.

4.2.  LMA Considerations

   o  The conceptual Binding Cache entry data structure maintained by
      the local mobility anchor, described in Section 5.1 of [RFC5213],
      MUST be extended to store the access-network-related information
      elements associated with the current session.  Specifically, the
      following parameters MUST be defined:

      *  Civic-Location

      *  MAG Group-Identifier



Pazhyannur, et al.      Expires January 23, 2015                [Page 7]

Internet-Draft              Extensions to ANI                  July 2014


      *  ANI Update-Timer

   o  On receiving a Proxy Binding Update message from a MAG with the
      ANI option, the LMA must process the option and update the
      corresponding fields in the Binding Cache entry.  If the option is
      not understood by that LMA implementation, it will skip the option
      and process the PBU without these options.

   o  If the received Proxy Binding Update message does not include the
      Access Network Information option, then the mobility session
      associated with that Proxy Binding Update MUST be updated to
      remove any access network information elements.

   o  If the local mobility anchor understands/supports the Access
      Network Identifier mobility sub-options defined in this
      specification, then the local mobility anchor MUST echo the Access
      Network Identifier mobility option with the specific sub-option(s)
      that it accepted back to the mobile access gateway in a Proxy
      Binding Acknowledgement.  The Civic location and Group-Identifier
      sub-options defined in this specification MUST NOT be altered by
      the local mobility anchor.  The LMA may change the value of the
      Update-Timer sub option.  It may choose to either echo the same
      value, or increase or decrease the timer value.  For example, if
      the LMA does not want to receive frequent updates (as implied by
      the timer value) it may choose to increase the value.  Similarly,
      if the LMA needs to receive ANI updates as soon as possible then
      it may set the value to zero (0) in the PBA.

5.  IANA Considerations

   This document requires the following IANA action.

   o  Action-1: This specification defines a new Access Network
      Identifier sub-option called Civic-Location Sub-option.  This
      mobility sub-option is described in Section 3.1 and this sub-
      option can be carried in Access Network Identifier mobility
      option.  The type value <IANA-1> for this sub-option needs to be
      allocated from the registry "Access Network Information (ANI) Sub-
      Option Type Values".  RFC Editor: Please replace <IANA-1> in
      Section 3.1 with the assigned value, and update this section
      accordingly.

   o  Action-2: This specification defines a new Access Network
      Identifier sub-option called MAG Group-Identifier Sub-option.
      This mobility sub-option is described in Section 3.2 and this sub-
      option can be carried in Access Network Identifier mobility
      option.  The type value <IANA-2> for this sub-option needs to be
      allocated from the registry "Access Network Information (ANI) Sub-



Pazhyannur, et al.      Expires January 23, 2015                [Page 8]

Internet-Draft              Extensions to ANI                  July 2014


      Option Type Values".  RFC Editor: Please replace <IANA-2> in
      Section 3.2 with the assigned value, and update this section
      accordingly.

   o  Action-3: This specification defines a new Access Network
      Identifier sub-option called ANI-Update-Timer Sub-option.  This
      sub-option is described in Section 3.3 and this sub-option can be
      carried in Access Network Identifier mobility option.  The type
      value <IANA-3> for this sub-option needs to be allocated from the
      registry "Access Network Information (ANI) Sub-Option Type
      Values".  RFC Editor: Please replace <IANA-3> in Section 3.3 with
      the assigned value, and update this section accordingly.

6.  Security Considerations

   The Civic-Location sub-option defined in this specification is
   carried in the Access Network Identifier option defined in [RFC6757].
   This sub-option is carried in Proxy Binding Update and Proxy Binding
   Acknowledgement messages.  This sub-option is carried like any other
   Access Network Identifier sub-option as defined in [RFC6757].
   Therefore, it inherits from [RFC5213] and [RFC6757], its security
   guidelines and does not require any additional security
   considerations.

   The Civic-Location sub-option carried in the Access Network
   Information option exposes the civic location of the network to which
   the mobile node is attached.  This information is considered to be
   very sensitive, so care must be taken to secure the Proxy Mobile IPv6
   signaling messages when carrying this sub-option.  The base Proxy
   Mobile IPv6 specification [RFC5213] specifies the use of IPSec for
   securing the signaling messages, and those mechanisms can be enabled
   for protecting this information.  Operators can potentially apply
   IPSec Encapsulating Security Payload (ESP) with confidentiality and
   integrity protection for protecting the location information.

   Access-network-specific information elements that the mobile access
   gateway sends may have been dynamically learned over DHCP or using
   other protocols.  If proper security mechanisms are not in place, the
   exchanged information between the MAG and LMA may be compromised.
   This situation may result in incorrect service policy enforcement at
   the local mobility anchor and impact to other services that depend on
   this access network information.  This threat can be mitigated by
   ensuring the communication path between the mobile access gateway and
   the access points is properly secured by the use of IPSec, Transport
   Layer Security (TLS), or other security protocols.






Pazhyannur, et al.      Expires January 23, 2015                [Page 9]

Internet-Draft              Extensions to ANI                  July 2014


7.  Acknowledgements

   TBD

8.  References

8.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC4776]  Schulzrinne, H., "Dynamic Host Configuration Protocol
              (DHCPv4 and DHCPv6) Option for Civic Addresses
              Configuration Information", RFC 4776, November 2006.

   [RFC5139]  Thomson, M. and J. Winterbottom, "Revised Civic Location
              Format for Presence Information Data Format Location
              Object (PIDF-LO)", RFC 5139, February 2008.

   [RFC5213]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K.,
              and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

   [RFC5844]  Wakikawa, R. and S. Gundavelli, "IPv4 Support for Proxy
              Mobile IPv6", RFC 5844, May 2010.

   [RFC6757]  Gundavelli, S., Korhonen, J., Grayson, M., Leung, K., and
              R. Pazhyannur, "Access Network Identifier (ANI) Option for
              Proxy Mobile IPv6", RFC 6757, October 2012.

8.2.  Informative References

   [RFC5415]  Calhoun, P., Montemurro, M., and D. Stanley, "Control And
              Provisioning of Wireless Access Points (CAPWAP) Protocol
              Specification", RFC 5415, March 2009.

   [RFC5416]  Calhoun, P., Montemurro, M., and D. Stanley, "Control and
              Provisioning of Wireless Access Points (CAPWAP) Protocol
              Binding for IEEE 802.11", RFC 5416, March 2009.

Authors' Addresses

   Rajesh S. Pazhyannur
   Cisco
   170 West Tasman Drive
   San Jose, CA 95134
   USA

   Email: rpazhyan@cisco.com



Pazhyannur, et al.      Expires January 23, 2015               [Page 10]

Internet-Draft              Extensions to ANI                  July 2014


   Sebastian Speicher
   Cisco
   Richtistrasse 7
   Wallisellen, Zurich  8304
   Switzerland

   Email: sespeich@cisco.com


   Sri Gundavelli
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sgundave@cisco.com


   Jouni Korhonen
   Broadcom
   Porkkalankatu 24
   Helsinki  FIN-00180
   Finland

   Email: jouni.nospam@gmail.com


   John Kaippallimalil
   Huawei
   5340 Legacy Drive, Suite 175
   Plano, Texas  75024
   USA

   Email: john.kaippallimalil@huawei.com

















Pazhyannur, et al.      Expires January 23, 2015               [Page 11]
